AmbiqMicro/lv_port_ambiq/lvgl_ambiq_porting/NemaGFX_hal/apollo510L_nemagfx/nema_dc_hal.c
    return true;
}
//*****************************************************************************
//
//! @brief Register a dedicated TE callback function
//!
//! @param  fnTECallback                - DC TE interrupt callback function
//!
//! This function registers an extra custom callback function for TE interrupt.
//!
//! @return None.
//
//*****************************************************************************
void
nemadc_set_te_interrupt_callback(nema_dc_interrupt_callback fnTECallback)
{
    nemadc_te_cb = fnTECallback;
}

//*****************************************************************************
//
//! @brief Register a dedicated Vsync callback function
//!
//! @param  fnVsyncCallback - DC Vsync interrupt callback function
//! @param  arg             - DC Vsync interrupt callback argument
//!
//! This function registers an extra custom callback function for Vsync interrupt.
//!
//! @return None.
//
//*****************************************************************************
void
nemadc_set_vsync_interrupt_callback(nema_dc_interrupt_callback fnVsyncCallback, void* arg)
{
    nemadc_vsync_cb = fnVsyncCallback;
    vsync_arg = arg;
}

//*****************************************************************************
//
//! @brief wait NemaDC to become idle
//!
//! @param ui32Mask   - Mask for the status change.
//! @param ui32Value  - Target value for the status change.
//!
//! This function will delay for approximately the given number of microseconds
//! while checking for a status change, exiting when either the given time has
//! expired or the status change is detected.
//!
//! @return AM_HAL_STATUS_SUCCESS or AM_HAL_STATUS_TIMEOUT.
//
//*****************************************************************************
static uint32_t
wait_dbi_idle(uint32_t ui32Mask, uint32_t ui32Value)
{
    uint32_t ui32usMaxDelay = 100000;
//  uint32_t ui32Status;
    //
    // wait NemaDC to become idle
    //
    return am_hal_delay_us_status_change(ui32usMaxDelay, (uint32_t)&DC->STATUS, ui32Mask, ui32Value);
}
//*****************************************************************************
//
//! @brief wait jdi idle
//!
//! Please wait a time before executing functions nemadc_set_mode() and
//! nemadc_set_mip_panel_parameters() after the frame ends when enabling RTOS.
//!
//! @return AM_HAL_STATUS_SUCCESS.
//
//*****************************************************************************
static uint32_t
wait_mip_idle(void)
{
    //
    // Wait the real frame end of MiP(JDI) interface.
    //
    am_hal_delay_us((uint32_t)(fFormatPeriod * sMiPConfig.VCK_GCK_closing_pulses * sMiPConfig.VCK_GCK_width));
    //
    // Recover parameters before the next transmission.
    //
    nemadc_set_mode(0);
    nemadc_set_mip_panel_parameters(&sMiPConfig);
    return AM_HAL_STATUS_SUCCESS;
}

//*****************************************************************************
//
//! @brief control the NemaDC clock
//!
//! @param eClkControl  - Clock control option (enable/disable).
//! @param eClkSel      - Clock source selection.
//! @param ui32Divider  - Divider value to configure the clock speed.
//!
//! @return AM_HAL_STATUS_SUCCESS or ui32Status.
//!
//! This function enables or disables the NemaDC clock based on the provided
//! control parameter. If enabling the clock, the clock source and divider
//! will be configured accordingly. If disabling, the clock source and divider
//! parameters are ignored and should be set to 0.
//
//*****************************************************************************
uint32_t
nemadc_clock_control(display_clock_control_e eClkControl, display_clksrc_e eClkSel, uint32_t ui32Divider)
{
    uint32_t ui32Status = AM_HAL_STATUS_SUCCESS;
    switch(eClkControl)
    {
        case DISP_CLOCK_DISABLE:
            //
            // Get the currently used clock source
            //
            uint8_t ui8DISPClkSrc;
            ui8DISPClkSrc = CRM->DISPCLKCRM_b.DISPCLKCLKSEL;

            //
            // Disable DISP non-APB clock
            //
            ui32Status = am_hal_crm_control(DISPCLK, CLOCK_SET, false);
            if(ui32Status)
            {
                return ui32Status;
            }

            //
            // Disable DISP APB clock
            //
            ui32Status = am_hal_crm_control(DC, CLOCK_SET, false);
            if(ui32Status)
            {
                return ui32Status;
            }

            //
            // Reset DISP APB and DISP Modules
            //
            ui32Status = am_hal_crm_control(DC, RESET, true);
            if(ui32Status)
            {
                return ui32Status;
            }

            //
            // Disable DC clock
            //
            ui32Status = am_hal_clkgen_control(AM_HAL_CLKGEN_CONTROL_DISPCTRLCLK_DISABLE, NULL);
            if(ui32Status)
            {
                return ui32Status;
            }

            //
            // Release clk src by clock manager
            //
            if(ui8DISPClkSrc == DISPCLKSRC_PLLVCO)
            {
                ui32Status = am_hal_clkmgr_clock_release(AM_HAL_CLKMGR_CLK_ID_PLLVCO, AM_HAL_CLKMGR_USER_ID_DC);
                if(ui32Status)
                {
                    return ui32Status;
                }
            }
            else if(ui8DISPClkSrc == DISPCLKSRC_HFRC_192MHz)
            {
                ui32Status = am_hal_clkmgr_clock_release(AM_HAL_CLKMGR_CLK_ID_HFRC, AM_HAL_CLKMGR_USER_ID_DC);
                if(ui32Status)
                {
                    return ui32Status;
                }
            }
        break;

        case DISP_CLOCK_ENABLE:
            //
            // Check if the DC peripheral is already enabled.
            //
            bool bStatus = true;
            am_hal_pwrctrl_periph_enabled(AM_HAL_PWRCTRL_PERIPH_DISP, &bStatus);
            if(!bStatus)
            {
                //
                // If not enabled, enable the DC peripheral.
                // This is required to ensure correct CRM configuration order:
                //
                // 1.Enable DC power
                // 2.Set CLKGEN->CLKCTRL.DISPCTRLCLKEN
                // 3.Set CRM->APBDISPCRM.APBDISPCLKEN
                //
                // Failing to enable the DC may cause APBDISPCRM->APBDISPCLKACTIVE 
                // bitfield never assert.
                //
                ui32Status = am_hal_pwrctrl_periph_enable(AM_HAL_PWRCTRL_PERIPH_DISP);
                if(ui32Status)
                {
                    return ui32Status;
                }
            }

            ui32Status = am_hal_crm_config(DISPCLK, (CRM_DISPCLKCRM_DISPCLKCLKSEL_Enum)eClkSel, ui32Divider - 1);
            if(ui32Status)
            {
                return ui32Status;
            }

            //
            // Request clk src by clock manager
            //
            if(eClkSel == DISPCLKSRC_PLLVCO)
            {
                ui32Status = am_hal_clkmgr_clock_request(AM_HAL_CLKMGR_CLK_ID_PLLVCO, AM_HAL_CLKMGR_USER_ID_DC);
                if(ui32Status)
                {
                    return ui32Status;
                }
            }
            else if(eClkSel == DISPCLKSRC_HFRC_192MHz)
            {
                ui32Status = am_hal_clkmgr_clock_request(AM_HAL_CLKMGR_CLK_ID_HFRC, AM_HAL_CLKMGR_USER_ID_DC);
                if(ui32Status)
                {
                    return ui32Status;
                }
            }

            //
            // Enable DC clock
            //
            ui32Status = am_hal_clkgen_control(AM_HAL_CLKGEN_CONTROL_DISPCTRLCLK_ENABLE, NULL);
            if(ui32Status)
            {
                return ui32Status;
            }

            //
            // Enable DISP APB clock
            //
            ui32Status = am_hal_crm_control(DC, CLOCK_SET, true);
            if(ui32Status)
            {
                return ui32Status;
            }

            //
            // Enable DISP non-APB clock
            //
            ui32Status = am_hal_crm_control(DISPCLK, CLOCK_SET, true);
            if(ui32Status)
            {
                return ui32Status;
            }
        break;

        default:
            return AM_HAL_STATUS_INVALID_ARG;
    }
    return AM_HAL_STATUS_SUCCESS;
}

//*****************************************************************************
//
// DC power control function
//
//*****************************************************************************
uint32_t
nemadc_power_control(am_hal_sysctrl_power_state_e ePowerState, bool bRetainState)
{
    uint32_t ui32Status = AM_HAL_STATUS_SUCCESS;
    bool bStatus = true;
    am_hal_pwrctrl_periph_enabled(AM_HAL_PWRCTRL_PERIPH_DISP, &bStatus);

    //
    // This API does nothing for DSI mode, DSI power control API will take care DC power control by itself.
    //
    if (bDCRegBackup && (ui32DCRegBlock0[NEMADC_REG_INTERFACE_CFG/4] & (MIPICFG_EXT_CTRL | MIPICFG_BLANKING_EN)))
    {
        return AM_HAL_STATUS_INVALID_OPERATION;
    }

    if (bStatus && (nemadc_reg_read(NEMADC_REG_INTERFACE_CFG) & (MIPICFG_EXT_CTRL | MIPICFG_BLANKING_EN)))
    {
        return AM_HAL_STATUS_INVALID_OPERATION;
    }
    //
    // Decode the requested power state and update DC operation accordingly.
    //
    switch (ePowerState)
    {
        case AM_HAL_SYSCTRL_WAKE:
            if (bStatus)
            {
                return AM_HAL_STATUS_IN_USE;
            }
            //
            // Enable power.
            //
            ui32Status = am_hal_pwrctrl_periph_enable(AM_HAL_PWRCTRL_PERIPH_DISP);
            if (ui32Status != AM_HAL_STATUS_SUCCESS)
            {
                return ui32Status;
            }

