AmbiqMicro/lv_port_ambiq/lvgl_ambiq_porting/NemaGFX_hal/apollo510L_nemagfx/nema_dc_hal.c
            if(bClkConfigBackup)
            {
                //
                // Restore DC clock
                //
                ui32Status = nemadc_clock_control(DISP_CLOCK_ENABLE, ui8DCClkSrc, ui8DCClkDivider);
                if (ui32Status != AM_HAL_STATUS_SUCCESS)
                {
                    return ui32Status;
                }
            }
            else
            {
                //
                // There is no valid DC CLK backup configuration.
                //
                return AM_HAL_STATUS_FAIL;
            }

            //
            // Initialize NemaDC, it includes enable interrupt
            //
            if ( nemadc_init() != AM_HAL_STATUS_SUCCESS )
            {
                return AM_HAL_STATUS_FAIL;
            }
            if (bRetainState && bDCRegBackup)
            {
                //
                // Restore DC registers
                //
                nemadc_restore_registers();
                //
                // Enable clock
                //
                nemadc_reg_write(NEMADC_REG_CLKCTRL_CG, nemadc_reg_read(NEMADC_REG_CLKCTRL_CG) | NemaDC_clkctrl_cg_clk_en);
            }
            else
            {
                //
                // Please invoke function nemadc_configure() to initialize DC registers.
                //
            }
            break;
        case AM_HAL_SYSCTRL_NORMALSLEEP:
        case AM_HAL_SYSCTRL_DEEPSLEEP:
            if (bStatus)
            {
                //
                // Check pending transaction
                //
                if (AM_HAL_STATUS_TIMEOUT == wait_dbi_idle(DC_STATUS_dbi_pending_cmd | DC_STATUS_dbi_busy, 0x0U))
                {
                    return AM_HAL_STATUS_IN_USE;
                }
                //
                // Disable clock
                //
                nemadc_reg_write(NEMADC_REG_CLKCTRL_CG, nemadc_reg_read(NEMADC_REG_CLKCTRL_CG) & ~NemaDC_clkctrl_cg_clk_en);

                if (bRetainState)
                {
                    //
                    // Backup DC registers
                    //
                    nemadc_backup_registers();
                }
                //
                // Disable interrupt
                //
                NVIC_DisableIRQ(NEMADC_IRQ);

                //
                // Store the clock configuration of DC
                //
                ui8DCClkSrc = CRM->DISPCLKCRM_b.DISPCLKCLKSEL;
                ui8DCClkDivider = CRM->DISPCLKCRM_b.DISPCLKCLKDIV;
                bClkConfigBackup = true;

                //
                // Disable and release DC clock.
                //
                nemadc_clock_control(DISP_CLOCK_DISABLE, 0, 0);
                if(ui32Status)
                {
                    return ui32Status;
                }

                //
                // Disable power
                //
                am_hal_pwrctrl_periph_disable(AM_HAL_PWRCTRL_PERIPH_DISP);
            }
            break;
        default:
            return AM_HAL_STATUS_INVALID_ARG;
    }
    //
    // Return the status.
    //
    return ui32Status;
} // nemadc_power_ctrl()

//*****************************************************************************
//
//! @brief Configure NemaDC.
//!
//! @param  psDCConfig     - NemaDC configuration structure.
//!
//! This function configures NemaDC display interface, output color format,
//! clock settings, TE setting and timing.
//!
//! @return None.
//
//*****************************************************************************
void
nemadc_configure(nemadc_initial_config_t *psDCConfig)
{
    uint32_t cfg = 0;
    if (psDCConfig->eInterface == DISP_INTERFACE_DBI || psDCConfig->eInterface == DISP_INTERFACE_DBIDSI)
    {
        //
        // Program NemaDC MIPI interface
        //
        if (psDCConfig->eInterface == DISP_INTERFACE_DBIDSI)
        {
            if (CRM->DISPCLKCRM_b.DISPCLKCLKSEL == CRM_DISPCLKCRM_DISPCLKCLKSEL_HFRC_192MHz && CRM->DISPCLKCRM_b.DISPCLKCLKDIV == 0)
            {
                //
                // Set the primary divider ratio to 2 to make sure the pixel clock isn't greater than 96MHz and bypass predivider
                //
                nemadc_clkdiv(2, 1, 4, 0);
            }
            else
            {
                //
                // Set the primary divider ratio to 0 or 1,it's bypass the primary divider.the swap feature is invalid in this situation.
                // After this configuration, both pixel_clk and format_clk's frequencies are from pll_clk through predivider if its value is equal to 0 or 1;
                // they are from pll_clk directly when its value is 0 or 1.
                //
                nemadc_clkdiv(1, 1, 4, 0);
            }
            cfg = MIPICFG_DBI_EN | MIPICFG_RESX | MIPICFG_EXT_CTRL | MIPICFG_BLANKING_EN | MIPICFG_EN_STALL | psDCConfig->ui32PixelFormat;
            //
            // Setting the DBIB_CLK clock frequency is the half of the format clock, that is 96MHz.(This is the limitation of the DSI host)
            //
            nemadc_reg_write(NEMADC_REG_FORMAT_CTRL2, 0x2U << 30);
        }
        else
        {
            int i32PreDivider;
            float fPLLCLKFreq;
            //
            // Calculated the present clock source frequency.
            //
            fPLLCLKFreq = 192.0 / (CRM->DISPCLKCRM_b.DISPCLKCLKDIV + 1);
            i32PreDivider = nema_ceil(fPLLCLKFreq / psDCConfig->fCLKMaxFreq);

            //
            // The value of the predivider should be less than 128.
            //
            if(i32PreDivider > 127)
            {
                return;
            }
            nemadc_clkdiv( 1, i32PreDivider, 4, 0);

            cfg = MIPICFG_DBI_EN | MIPICFG_RESX | psDCConfig->ui32PixelFormat;
        }
        if (psDCConfig->bTEEnable)
        {
            cfg |= MIPICFG_DIS_TE;
        }
        nemadc_MIPI_CFG_out(cfg);
        //
        // Program NemaDC to transfer a resx*resy region
        //
        psDCConfig->ui32FrontPorchX = 1;
        psDCConfig->ui32BlankingX = 1;
        psDCConfig->ui32BackPorchX = 1;
        psDCConfig->ui32FrontPorchY = 1;
        psDCConfig->ui32BlankingY = 1;
        psDCConfig->ui32BackPorchY = 1;
    }
    else if ((psDCConfig->eInterface == DISP_INTERFACE_QSPI) ||
             (psDCConfig->eInterface == DISP_INTERFACE_DSPI) ||
             (psDCConfig->eInterface == DISP_INTERFACE_SPI4) ||
             (psDCConfig->eInterface == DISP_INTERFACE_QSPI_DDR))
    {
        //
        // Bypass primary divider and predivider
        //
        nemadc_clkdiv(1, 1, 4, 0);
        cfg = MIPICFG_SPI_CSX_V | MIPICFG_DBI_EN | MIPICFG_RESX | MIPICFG_SPI4 | psDCConfig->ui32PixelFormat;
        if (psDCConfig->eInterface == DISP_INTERFACE_QSPI)
        {
#ifndef AM_DISP_CPOL_CPHA_SETTING_OUTSIDE
            cfg |= MIPICFG_QSPI | MIPICFG_SPI_CPOL | MIPICFG_SPI_CPHA;
#else
            cfg |= MIPICFG_QSPI;
#endif
        }
        else if (psDCConfig->eInterface == DISP_INTERFACE_DSPI)
        {
            cfg |= MIPICFG_DSPI;
        }
        else if (psDCConfig->eInterface == DISP_INTERFACE_QSPI_DDR)
        {
            cfg |= MIPICFG_QSPI_DDR;
        }

        if(psDCConfig->bTEEnable)
        {
            cfg |= MIPICFG_DIS_TE;
        }
        nemadc_MIPI_CFG_out(cfg);
        // Program NemaDC to transfer a resx*resy region
        psDCConfig->ui32FrontPorchX = 1;
        psDCConfig->ui32BlankingX = 1;
        psDCConfig->ui32BackPorchX = 1;
        psDCConfig->ui32FrontPorchY = 1;
        psDCConfig->ui32BlankingY = 1;
        psDCConfig->ui32BackPorchY = 1;
    }
    else if (psDCConfig->eInterface == DISP_INTERFACE_JDI)
    {
        int i32PreDivider,i32PrimaryDivider;
        float fPLLCLKFreq;
#ifdef APOLLO5_FPGA
        fPLLCLKFreq = APOLLO5_FPGA;
#else
        fPLLCLKFreq = 192.0 / (CRM->DISPCLKCRM_b.DISPCLKCLKDIV + 1);
#endif
        //
        // Calculate the Optimal solution primary divider and predivider for the JDI interface.
        //
        //
        // To reach a higher performance,we should make sure the frequencies of BCK(its frequency is a quarter of format_clk)
        // and GCK less than its maximum supported of the panel.
        //
        if (fPLLCLKFreq / (4 * psDCConfig->fHCKBCKMaxFreq) > psDCConfig->fHCKBCKMaxFreq / psDCConfig->fVCKGCKFFMaxFreq)
        {
            //
            // Calculate the primary divider,to make BCK frequency less than panel limitation.
            //
            i32PrimaryDivider = nema_ceil(fPLLCLKFreq / (4 * psDCConfig->fHCKBCKMaxFreq));
            //
            // The minimum of primary divider is 2 to enable the divider swap feature.
            //
            if (i32PrimaryDivider < 2)
            {
                i32PrimaryDivider = 2;
            }
            //
            // Set the predivider to 1, to bapass it.
            //
            i32PreDivider = 1;
        }
        else
        {
            //
            // Calculate primary divider to assure the frequency of GCK less than its maximum supported.
            //
            i32PrimaryDivider = (int)(psDCConfig->fHCKBCKMaxFreq / psDCConfig->fVCKGCKFFMaxFreq);
            //
            // The minimum of primary divider is 2 to enable the divider swap feature.
            //
            if (i32PrimaryDivider < 2)
            {
                i32PrimaryDivider = 2;
            }
            //
            // Calculate predivider to assure the frequency of BCK less than its maximum supported.
            //
            i32PreDivider = nema_ceil(fPLLCLKFreq / (4 * psDCConfig->fHCKBCKMaxFreq * i32PrimaryDivider));
        }

        nemadc_clkdiv(i32PrimaryDivider, i32PreDivider, 4, 0);

        sMiPConfig.resx                    = psDCConfig->ui16ResX;
        sMiPConfig.resy                    = psDCConfig->ui16ResY;
        sMiPConfig.XRST_INTB_delay         = psDCConfig->ui32XRSTINTBDelay;
        sMiPConfig.XRST_INTB_width         = psDCConfig->ui32XRSTINTBWidth;
        sMiPConfig.VST_GSP_delay           = psDCConfig->ui32VSTGSPDelay;
        sMiPConfig.VST_GSP_width           = psDCConfig->ui32VSTGSPWidth;
        sMiPConfig.VCK_GCK_delay           = psDCConfig->ui32VCKGCKDelay;
        sMiPConfig.VCK_GCK_width           = psDCConfig->ui32VCKGCKWidth;
        sMiPConfig.VCK_GCK_closing_pulses  = psDCConfig->ui32VCKGCKClosingPulses;
        sMiPConfig.HST_BSP_delay           = psDCConfig->ui32HSTBSPDelay;
        sMiPConfig.HST_BSP_width           = psDCConfig->ui32HSTBSPWidth;
        sMiPConfig.HCK_BCK_data_start      = psDCConfig->ui32HCKBCKDataStart;
        sMiPConfig.ENB_GEN_delay           = psDCConfig->ui32ENBGENDelay;
        sMiPConfig.ENB_GEN_width           = psDCConfig->ui32ENBGENWidth;
        nemadc_set_mip_panel_parameters(&sMiPConfig);
        nemadc_reg_write(NEMADC_REG_CLKCTRL_CG, NemaDC_clkctrl_cg_clk_swap | NemaDC_clkctrl_cg_clk_en);
        fFormatPeriod = 1.0 / (psDCConfig->fHCKBCKMaxFreq * 4);
        return;
    }
    else if (psDCConfig->eInterface == DISP_INTERFACE_DPI)
    {
        int i32PreDivider;
        float fPLLCLKFreq;
        fPLLCLKFreq = 192.0 / (CRM->DISPCLKCRM_b.DISPCLKCLKDIV + 1);
        i32PreDivider = nema_ceil(fPLLCLKFreq / psDCConfig->fCLKMaxFreq);

        //
        // The value of the predivider should be less than 128.
        //
        if(i32PreDivider > 127)
        {
            return;
        }
        nemadc_clkdiv( 1, i32PreDivider, 4, 0);

        //
        // Configure DPI(RGB) interface color coding, Hsync and Vsync polarity.
        //
        nemadc_reg_write(NEMADC_REG_MODE, NEMADC_NEG_V | NEMADC_NEG_H | psDCConfig->ui32PixelFormat);
    }

    nemadc_timing(psDCConfig->ui16ResX,
                  psDCConfig->ui32FrontPorchX,
                  psDCConfig->ui32BlankingX,
                  psDCConfig->ui32BackPorchX,
                  psDCConfig->ui16ResY,
                  psDCConfig->ui32FrontPorchY,
                  psDCConfig->ui32BlankingY,
                  psDCConfig->ui32BackPorchY);
    //
    // Enable clock divider.
    //
    if (psDCConfig->eInterface == DISP_INTERFACE_DPI)
    {
        //
        // Invert clock polarity
        //
        nemadc_reg_write(NEMADC_REG_CLKCTRL_CG, NemaDC_clkctrl_cg_clk_inv | NemaDC_clkctrl_cg_clk_en);
    }
    else
    {
        nemadc_reg_write(NEMADC_REG_CLKCTRL_CG, NemaDC_clkctrl_cg_clk_en);
    }
}

//*****************************************************************************
//
//! @brief Prepare operations before sending frame
//!
//! @param  bAutoLaunch    - true:  launch transfer in DC TE interrupt implicitly.
//!                        - false: please launch the transfer explicitly.
//! @param  bContinue      - true:  write memory continue(0x3C)
//!                        - false: write memory start(0x2C)
//!
//! Note 1: Setting the first parameter(bAutoLaunch) to true when writing memory
//! continues(0x3C) is not recommended because this could spot a severe tear effect
//! on the display.
//! Note 2: Setting the first parameter(bAutoLaunch) to true is invalid when the TE
//! bitfield(MIPICFG_DIS_TE) isn't configured in register NEMADC_REG_DBIB_CFG.The user
//! launch the transfer explicitly.
//!
//! @return None.
//
//*****************************************************************************
static void
dc_transfer_frame(bool bAutoLaunch, bool bContinue)
{
    uint32_t ui32Cfg = nemadc_reg_read(NEMADC_REG_DBIB_CFG);
    uint32_t ui32MemWrCmd = bContinue ? MIPI_write_memory_continue : MIPI_write_memory_start;
    //
    // Check present interface is DBI/DSI or not.
    //
    if (((ui32Cfg & MIPICFG_DBI_EN) != 0) &&
        ((ui32Cfg & (MIPICFG_SPI3 | MIPICFG_SPI4 | MIPICFG_DSPI | MIPICFG_QSPI | MIPICFG_DSPI_SPIX )) == 0))
    {
        //
        // Bitfields MIPICFG_EXT_CTRL,MIPICFG_BLANKING_EN only configured for the DSI interface.
        //
        if (ui32Cfg & (MIPICFG_EXT_CTRL | MIPICFG_BLANKING_EN))
        {
            nemadc_reg_write(NEMADC_REG_GPIO, nemadc_reg_read(NEMADC_REG_GPIO) & (~0x1));//HS
            //
            // disable clock gating
            //
            nemadc_reg_write(NEMADC_REG_CLKCTRL_CG, 0xFFFFFFF0U | NemaDC_clkctrl_cg_clk_en);

