AmbiqMicro/lv_port_ambiq/lvgl_ambiq_porting/NemaGFX_hal/apollo510L_nemagfx/nema_dc_hal.c
            wait_dbi_idle(DC_STATUS_dbi_busy, 0x0U);
            //
            // Set data/commands command type
            //
            nemadc_dsi_ct(NemaDC_dt_DCS_long_write, // Unused parameter
                          NemaDC_dt_DCS_long_write, // Unused parameter
                          NemaDC_dcs_datacmd);
#ifdef MANUALLY_CONTROL_DBIB_CSX
            nemadc_MIPI_CFG_out(ui32Cfg | MIPICFG_SPI_HOLD | MIPICFG_FRC_CSX_0);
            //
            // Send DCS write_memory_start command
            //
            nemadc_MIPI_out(MIPI_DBIB_CMD | ui32MemWrCmd);
#else
            nemadc_MIPI_CFG_out(ui32Cfg | MIPICFG_SPI_HOLD);
            //
            // Send DCS write_memory_start command
            //
            nemadc_MIPI_out(MIPI_DBIB_CMD | ui32MemWrCmd);
            wait_dbi_idle(DC_STATUS_dbi_busy, 0x0U);
#endif
        }
        else
        {
            nemadc_MIPI_CFG_out(ui32Cfg | MIPICFG_FRC_CSX_0);
            nemadc_MIPI_out(MIPI_DBIB_CMD | NemaDC_wcmd24 | (ui32MemWrCmd << 8));
        }
    }
    else if ((ui32Cfg & (MIPICFG_SPI3 | MIPICFG_SPI4 | MIPICFG_DSPI | MIPICFG_QSPI)) != 0)
    {
        //
        // Enable clock divider
        //
        nemadc_reg_write(NEMADC_REG_CLKCTRL_CG, NemaDC_clkctrl_cg_clk_en);
        if ((ui32Cfg & MIPICFG_QSPI) != 0)
        {
            //
            // QSPI interface
            //
            nemadc_MIPI_CFG_out( ui32Cfg | MIPICFG_SPI_HOLD);
            nemadc_MIPI_out( MIPI_DBIB_CMD | MIPI_MASK_QSPI | CMD1_DATA4);
            nemadc_MIPI_out( MIPI_DBIB_CMD | MIPI_MASK_QSPI | MIPI_CMD24 |
                            (ui32MemWrCmd << CMD_OFFSET));
        }
        else if((ui32Cfg & MIPICFG_DSPI) != 0)
        {
            //
            // DSPI interface
            //
            nemadc_MIPI_CFG_out( ui32Cfg & (~MIPICFG_DSPI));
            // Start MIPI Panel Memory Write
            nemadc_MIPI_out(MIPI_DBIB_CMD | ui32MemWrCmd);
            nemadc_MIPI_CFG_out(((ui32Cfg & (~MIPICFG_SPI4)) | MIPICFG_SPI3) | MIPICFG_SPIDC_DQSPI | MIPICFG_SPI_HOLD);
        }
        else
        {
            //
            // SPI4 interface
            //
            nemadc_MIPI_CFG_out( ui32Cfg | MIPICFG_SPI_HOLD);
            // Start MIPI Panel Memory Write
            nemadc_MIPI_out(MIPI_DBIB_CMD | ui32MemWrCmd);
        }
    }
    //
    // turn DC TE interrupt
    //
    if (ui32Cfg & MIPICFG_DIS_TE)
    {
        bNeedLaunchInTe = bAutoLaunch;
        nemadc_reg_write(NEMADC_REG_INTERRUPT, 1 << 3);
    }
}

//*****************************************************************************
//
//! @brief Prepare operations before writing memory start
//!
//! @param  bAutoLaunch    - true:launch transfer in DC TE interrupt implicitly.
//!                        - false: please launch the transfer explicitly.
//!
//! Setting the parameter(bAutoLaunch) to true is invalid when the TE enabling
//! bitfield(MIPICFG_DIS_TE) isn't configured in register NEMADC_REG_DBIB_CFG.
//! Please launch the transfer explicitly.
//!
//! @return None.
//
//*****************************************************************************
void
nemadc_transfer_frame_prepare(bool bAutoLaunch)
{
    dc_transfer_frame(bAutoLaunch, false);
}

//*****************************************************************************
//
//! @brief Prepare operations before writing memory continue
//!
//! @param  bAutoLaunch    - true:launch the transfer implicitly.(Not recommended)
//!                        - false: please launch the transfer explicitly.(recommended)
//!
//! Setting the parameter(bAutoLaunch) to true is not recommended because this
//! could spot a severe tear effect on the display.
//!
//! @return None.
//
//*****************************************************************************
void
nemadc_transfer_frame_continue(bool bAutoLaunch)
{
    dc_transfer_frame(bAutoLaunch, true);
}

//*****************************************************************************
//
//! @brief Launch frame transfer
//!
//! This function enables DC frame end interrupt and launches frame transfer.
//!
//! @return None.
//
//*****************************************************************************
void
nemadc_transfer_frame_launch()
{
    uint32_t ui32Cfg = nemadc_reg_read(NEMADC_REG_DBIB_CFG);
    //
    // Check present interface is DBI/DSI or not.
    //
    if (((ui32Cfg & MIPICFG_DBI_EN) != 0) &&
        ((ui32Cfg & (MIPICFG_SPI3 | MIPICFG_SPI4 | MIPICFG_DSPI | MIPICFG_QSPI | MIPICFG_DSPI_SPIX )) == 0))
    {
        //
        // Enable frame end interrupt for DBI/DSI interface.
        //
        nemadc_reg_write(NEMADC_REG_INTERRUPT, 1 << 4);
        nemadc_set_mode(NEMADC_ONE_FRAME | NEMADC_OUTP_OFF);
    }
    else if (((ui32Cfg & (MIPICFG_SPI3 | MIPICFG_SPI4 | MIPICFG_DSPI | MIPICFG_QSPI | MIPICFG_DSPI_SPIX)) != 0))
    {
        //
        // Enable spi frame end interrupt for SPI4/DSPI/QSPI interface.
        //
        nemadc_reg_write(NEMADC_REG_INTERRUPT, 1 << 5);
        //
        // Send One Frame
        //
        nemadc_set_mode(NEMADC_ONE_FRAME);
    }
    else if (0x3FF & nemadc_reg_read(NEMADC_REG_FORMAT_CTRL3))
    {
        //
        // Enable frame end interrupt for JDI interface.
        //
        nemadc_reg_write(NEMADC_REG_INTERRUPT, 1 << 4);
        nemadc_set_mode(NEMADC_ONE_FRAME | NEMADC_MIP_IF | NEMADC_SCANDOUBLE);
    }
    else
    {
        //
        // Enable frame end interrupt for DPI(RGB) interface.
        //
        nemadc_reg_write(NEMADC_REG_INTERRUPT, 1 << 4);

        nemadc_set_mode(NEMADC_ONE_FRAME | nemadc_reg_read(NEMADC_REG_MODE));
    }
}

//*****************************************************************************
//
//! @brief Required operations after completing frame transfer
//!
//! This function sets NemaDC back to normal mode after completing frame
//! transfer. This function should be called in frame end interrupt.
//!
//! @return None.
//
//****************************************************************************
static void
nemadc_transfer_frame_end()
{
    uint32_t ui32Cfg = nemadc_reg_read(NEMADC_REG_DBIB_CFG);
    //
    // Check present interface is DBI/DSI or not.
    //
    if (((ui32Cfg & MIPICFG_DBI_EN) != 0) &&
        ((ui32Cfg & (MIPICFG_SPI3 | MIPICFG_SPI4 | MIPICFG_DSPI | MIPICFG_QSPI | MIPICFG_DSPI_SPIX )) == 0))
    {
        //
        // Bitfields MIPICFG_EXT_CTRL,MIPICFG_BLANKING_EN only configured for the DSI interface.
        //
        if (ui32Cfg & (MIPICFG_EXT_CTRL | MIPICFG_BLANKING_EN))
        {
#ifdef MANUALLY_CONTROL_DBIB_CSX
            nemadc_MIPI_CFG_out(ui32Cfg & ~(MIPICFG_SPI_HOLD | MIPICFG_FRC_CSX_0));
#else
            nemadc_MIPI_CFG_out(ui32Cfg & (~MIPICFG_SPI_HOLD));
#endif
            nemadc_reg_write(NEMADC_REG_CLKCTRL_CG, NemaDC_clkctrl_cg_clk_en); // enable clock gating
            nemadc_reg_write(NEMADC_REG_GPIO, nemadc_reg_read(NEMADC_REG_GPIO) | 0x1); // LP
        }
        else
        {
            nemadc_MIPI_CFG_out(ui32Cfg & (~MIPICFG_FRC_CSX_0));
        }
    }
    else if ((ui32Cfg & (MIPICFG_SPI3 | MIPICFG_SPI4 | MIPICFG_DSPI | MIPICFG_QSPI)) != 0)
    {
        nemadc_MIPI_CFG_out((ui32Cfg | MIPICFG_SPI4) & (~(MIPICFG_SPI3 | MIPICFG_SPIDC_DQSPI | MIPICFG_SPI_HOLD)));
        //
        // enable clock gating
        //
        nemadc_reg_write(NEMADC_REG_CLKCTRL_CG, 0);
    }
    else if (0x3FF & nemadc_reg_read(NEMADC_REG_FORMAT_CTRL3))
    {
        //
        // Clear mode register
        //
    }
    else
    {
        //
        // Frame end operation for DPI(RGB) interface.
        //
    }

